app/Views/include/view_sidebar.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---

    if ($isLoggedIn) {
        $userModel = new \App\Models\UserModel();
        $user = $userModel->find(session()->get('user_id'));