app/Controllers/Auth.php

   public function profile()
{
    if (!session()->has('user_id')) {
        return redirect()->to('/login');
    }

    $userModel = new UserModel();
    $user = $userModel->find(session()->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'

    public function removePicture()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/login');
        }

        $userId = session()->get('user_id');
        $userModel = new UserModel();
        $user = $userModel->find($userId);

        $currentPic = $user['profile_picture'];

        if ($currentPic !== 'default.jpg') {

            $filePath = FCPATH . "public/uploads/profile/" . $currentPic;

            if (file_exists($filePath)) {
                unlink($filePath); // delete the image file
            }
        }

        $userModel->update($userId, [
            'profile_picture' => 'default.jpg'
        ]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'
UPDATE `users` SET `profile_picture` = 'default.jpg'
WHERE `users`.`id` IN ('5')